#include <iostream>
using namespace std;

int main()
{
    // Integer. Завдання:
    // Дано тризначне число.
    // Вивести число, отримане при прочитанні вихідного числа справа наліво.

    cout << "Завдання. Тризначне число (зворотній порядок цифр)" << endl;

    int N;       // вихідне тризначне число
    int a, b, c; // цифри числа
    int rev;     // результат — число навпаки

    // введення числа
    cout << "Введіть тризначне число: ";
    cin >> N;

    // підрахунок
    a = N / 100;        // перша цифра (сотні)
    b = (N / 10) % 10;  // друга цифра (десятки)
    c = N % 10;         // третя цифра (одиниці)

    rev = c * 100 + b * 10 + a; // число навпаки

    // виведення результату
    cout << "Число справа наліво: " << rev << endl;

    return 0;
}
